validation/denseAGFoam/verticleChannelFlow/constant/kineticTheoryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kineticTheoryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


equilibrium             off;

e                       0.8;
alphaMax                0.63;
alphaMinFriction        0.5;
residualAlpha           1e-4;

viscosityModel          Gidaspow;
conductivityModel       Gidaspow;
granularPressureModel   Lun;
frictionalStressModel   JohnsonJackson;
radialModel             SinclairJackson;

JohnsonJacksonCoeffs
{
    Fr                      0.05;
    eta                     2;
    p                       5;
    phi                     28.5;
}


// ************************************************************************* //
